{
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<START>": 2,
    "<END>": 3,
    "nvidia": 4,
    "gpu": 5,
    "graphics": 6,
    "shortage": 7,
    "supply": 8,
    "demand": 9,
    "fed": 10,
    "rate": 11,
    "interest": 12,
    "inflation": 13,
    "cpi": 14,
    "price": 15,
    "market": 16,
    "buy": 17,
    "sell": 18,
    "trade": 19,
    "stock": 20,
    "crypto": 21,
    "bitcoin": 22,
    "ethereum": 23,
    "amd": 24,
    "radeon": 25,
    "tariff": 26,
    "semiconductor": 27,
    "chip": 28,
    "ai": 29,
    "ml": 30,
    "continues": 31,
    "surges": 32,
    "training": 33,
    "decision": 34,
    "impacts": 35,
    "volatility": 36,
    "prices": 37,
    "drop": 38,
    "amid": 39,
    "competitive": 40,
    "pressure": 41,
    "chain": 42,
    "faces": 43,
    "challenges": 44,
    "and": 45,
    "show": 46,
    "bullish": 47,
    "sentiment": 48
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "<START>",
    "3": "<END>",
    "4": "nvidia",
    "5": "gpu",
    "6": "graphics",
    "7": "shortage",
    "8": "supply",
    "9": "demand",
    "10": "fed",
    "11": "rate",
    "12": "interest",
    "13": "inflation",
    "14": "cpi",
    "15": "price",
    "16": "market",
    "17": "buy",
    "18": "sell",
    "19": "trade",
    "20": "stock",
    "21": "crypto",
    "22": "bitcoin",
    "23": "ethereum",
    "24": "amd",
    "25": "radeon",
    "26": "tariff",
    "27": "semiconductor",
    "28": "chip",
    "29": "ai",
    "30": "ml",
    "31": "continues",
    "32": "surges",
    "33": "training",
    "34": "decision",
    "35": "impacts",
    "36": "volatility",
    "37": "prices",
    "38": "drop",
    "39": "amid",
    "40": "competitive",
    "41": "pressure",
    "42": "chain",
    "43": "faces",
    "44": "challenges",
    "45": "and",
    "46": "show",
    "47": "bullish",
    "48": "sentiment"
  },
  "word_freq": {
    "nvidia": 100,
    "gpu": 100,
    "shortage": 100,
    "continues": 100,
    "demand": 100,
    "surges": 100,
    "ai": 100,
    "training": 100,
    "fed": 100,
    "rate": 100,
    "decision": 100,
    "impacts": 100,
    "crypto": 100,
    "market": 100,
    "volatility": 100,
    "amd": 100,
    "radeon": 100,
    "prices": 100,
    "drop": 100,
    "amid": 100,
    "competitive": 100,
    "pressure": 100,
    "semiconductor": 100,
    "supply": 100,
    "chain": 100,
    "faces": 100,
    "tariff": 100,
    "challenges": 100,
    "bitcoin": 100,
    "and": 100,
    "ethereum": 100,
    "show": 100,
    "bullish": 100,
    "sentiment": 100,
    "graphics": 2,
    "interest": 2,
    "inflation": 2,
    "cpi": 2,
    "price": 2,
    "buy": 2,
    "sell": 2,
    "trade": 2,
    "stock": 2,
    "chip": 2,
    "ml": 2
  },
  "vocab_size": 5000,
  "min_freq": 2,
  "domain_keywords": [
    "nvidia",
    "gpu",
    "graphics",
    "shortage",
    "supply",
    "demand",
    "fed",
    "rate",
    "interest",
    "inflation",
    "cpi",
    "price",
    "market",
    "buy",
    "sell",
    "trade",
    "stock",
    "crypto",
    "bitcoin",
    "ethereum",
    "amd",
    "radeon",
    "tariff",
    "semiconductor",
    "chip",
    "ai",
    "ml"
  ]
}